[
	{
		"type" : "heading",
		"text" : "News"
	},
	{
		"type" : "post",
		"title" : "Stateware Gets Promoted",
		"author" : "Joshua Crafts",
		"date" : "22 June 2015",
		"first" : "With one successful semester under our belts and another hot on our heels, Stateware is making big changes! Registration for Stateware in the Fall of 2015 is already full, and we'll be starting the development cycle with 23 people, more than twice as many as this past Spring. To manage this growth, we're modifying the division of labor in the Stateware ecosystem.",
		"body" : "The biggest change is the appointment of Dylan Fetch and myself as CTO and CEO, respectively. As CEO, I will spend my time managing client and sponsor relationships, and making sure our developers are equipped with all of the tools and information they need for success. As CTO, Dylan will be overseeing the broad direction of all of our projects, as well as the work of our 3 new Project Leads.</p><p class='text'>Our Project Leads for Fall 2015 are Emma Roudabush, Kyle Nicholson, and Paul Jang. The remaining 6 developers from Spring 2015 will each be taking one of two spots on each development team as a Senior Developer, while our 12 newbies will be taking the remaining spots as Junior Developers. Dylan, myself, and the Project Leads will be holding a technical interview with each of the new Junior Developers to place them on each team. Going into Fall 2015, we have 3 well-rounded teams of 7 to tackle the future of Dav3i, as well as our two new projects, Galaxy, and an as-yet unnamed traffic system project."
	},
	{
		"type" : "post",
		"title" : "Post Mortem: Stateware Spring 2015",
		"author" : "Joshua Crafts",
		"date" : "22 June 2015",
		"first" : "On 30th April, 2015, we concluded the inaugural semester of Stateware with our very first release party! At the party, we presented the first release of <a href='http://dav3i.stateware.org'>Dav3i</a>, our first project and a proof of concept for Stateware as an educational model. Stateware provides an obvious benefit to Penn State's researchers, but our primary focus is developing the software engineering talent Penn State has to offer. With that in mind, there's immense value in reflecting on our successes and failures throughout the semester.",
		"body" : "</p><h5 class='inline-heading'>Delivering a Product</h5><p class='text'>The most effective indicator of our success is the delivery of a product. If we did not deliver a viable software product at the end of our development cycle, the viability of Stateware as teaching software engineering is clearly a moot point. Luckily, our efforts surpassed our expectations, and we were able to present a feature-rich software product that effectively met the goals set by our client.</p></br><h5 class='inline-heading'>Planning Ahead</h5><p class='text'>This was one area we fell short in. Stateware developed as an idea very quickly in Fall 2014, but settling details as late as December left little time to prepare for the beginning of our first development cycle. Because of our lack of development experience, what time we had was underutilized. We went into the semester without having made decisions regarding management platforms, development style, workflow, testing, version control, etc., and we felt the burden of that very quickly. Going into our next development cycle in Fall 2015, we have a lot of time to research, prepare, and adjust our approach to make Stateware the best it can be.</p></br><h5 class='inline-heading'>Management</h5><p class='text'>Because we spent our development cycle split between a front end and back end team, we were able to observe the pros and cons of 2 distinctly different management styles. What we learned from this was that our developers most thrived in a 'hands-off' environment, where they were self-directed to choose broad tasks, identify and solve problems, and ultimately take ownership of the development process. While the more 'hands-on' team delivered their part of the project just as well, the developers felt less ownership of the process and the product, which ultimately makes the 'hands-off' result the more desireable one.</p></br><h5 class='inline-heading'>Development Process/Schedule</h5><p class='text'>We attempted to follow an Agile development approach in this cycle, but eventually our process more resembled Waterfall. While we tried to break development up into Scrum-like sprints, and only set short term goals, the process still followed a more or less sequential arc. Without explicitly setting the schedule, our development lifecycle was more or less large blocks of design, coding, UI development, and testing, in that order. While this didn't align with our intentions, it gave us a high quality product; while we will research other alternatives, replicating this process in the future may still be a good idea.</p><p class='text'>The one major weakness of our development process in this first cycle was a lack of focus on testing. The back end team delivered a high quality test library, but the bulk of the front end team's testing was focused on manually testing the UI, which left some parts of the product without unit and specifications tests at release. In the future, our approach will include continuous integration testing and a firm policy on developing unit tests alongside code as it is written.</p></br><h5 class='inline-heading'>Client Relations</h5><p class='text'>Another area we plan to improve in the future is the level of communication with clients. Our communication with the client this semester only spanned a few meetings and demos throughout the semester. Since the number of clients will only increase for us, it's important that we dedicate time to their needs and requirements through the development of the project, so a single person will be dedicated to handling relations with clients and communicating project details to the technical manager and the project leads.</p></br><h5 class='inline-heading'>Developer Experience</h5><p class='text'>The experience a developer has on their team can have a drastic effect on their performance, so this is also a key metric for evaluating Stateware's success. We found that the developer's experience is largely based on their manager's approach to development, the level and effectiveness of communication, and the developer's motivation to self-direct and give value to their input. Universally (though with the caveat of a small sample size), we found that the happiest (and most productive) developer is assertive, well-briefed, and given free reign to solve problems without the burden of micro-management.</p><p class='text'>Our focus moving forward is focused on maximizing those aspects in each developer. To be sure, communicating effectively and managing is more under our control than a developer's propensity to assert their ideas; we want to maximize the effectiveness of all our developers, not just the outspoken ones. Getting the most out of the introverts among us and engaging them in the process is also one of our primary goals.</p></br><h5 class='inline-heading'>Conclusion</h5><p class='text'>Overall, Stateware Spring 2015 was a tremendous success. Despite a few setbacks, we delivered a high quality software product, and we took a lot of important lessons from the experience. These lessons will allow us to drastically strengthen Stateware's operating model to optimize the benefit it has to the Penn State community, and to the enterprise of CSE education."
	},
	{
		"type" : "post",
		"title" : "Stateware's Dav3i Project",
		"author" : "Dylan Fetch",
		"date" : "15 May 2015",
		"first" : "<a class='large-link' href='http://asmarterplanet.com/studentsfor/blog/2015/05/statewares-dav3i-project.html'>Original article here</a></p><p class='text'>Stateware finished its first release of the Dav3i project. We presented the project and what we learned during the course of the semester to our client, sponsors, including IBM representative Rich Prewitt who was a big help this semester, faculty, and fellow students at an end of the semester event. The product was well received and attendees were impressed at the lessons we learned in the pilot semester of Stateware. We plan to continue to expand Dav3i next semester to meet more advanced demands of the client. The Stateware group was impressed at what we were able to accomplish on this software this semester, and the improvement we made in the understanding of our client’s data, and we are excited to see what we can do with it moving forward.",
		"body" : ""
	},
	{
		"type" : "post",
		"title" : "Stateware Spring 2015 Release Party Media",
		"author" : "Joshua Crafts",
		"date" : "30 April 2015",
		"image" : {
			"src" : "res/04302015.jpg",
			"alt" : "Students in the 397 CSE class, STATEWARE, will present their semester's work to faculty and industry sponsors at an event they are hosting April 30. Image: Penn State",
			"height" : 675,
			"width" : 1200
		},
		"first" : "",
		"body" : ""
	},
	{
		"type" : "youtube",
		"source" : "qiyqD_vVKh8"
	},
	{
		"type" : "post",
		"title" : "Stateware to Present Semester’s Efforts at End of School Year Event",
		"author" : "Rebekka Coakley",
		"date" : "21 April 2015",
		"image" : {
			"src" : "res/04212015.jpg",
			"alt" : "Students in the 397 CSE class, STATEWARE, will present their semester's work to faculty and industry sponsors at an event they are hosting April 30. Image: Penn State",
			"height" : 411,
			"width" : 730
		},
		"first" : "<a class='large-link' href='http://news.psu.edu/story/353985/2015/04/21/academics/stateware-present-semester%E2%80%99s-efforts-end-school-year-event'>Original article here</a></p><p class='text'>Computer science class hosts inaugural event to unveil new software",
		"body" : "With four months of developing software for real-world applications now under their belt, students from the computer science class, “Students Taking Advantage of Their Education While Accelerating Research Efforts” (STATEWARE) are ready to present the culmination of this semester’s hard work to industry professionals, Penn State faculty and fellow computer science and engineering students.</p><p class='text'>The 11 STATEWARE students will host their inaugural end of semester event at 6 p.m. on Thursday, April 30, in 112 Walker Building. They will show the data visualization interface they built to track worldwide measles statistics for Matt Ferrari, an assistant professor of biology and statistics at Penn State and a researcher in the Huck Institutes' Center for Infectious Disease Dynamics. He is working with the World Health Organization to track and recommend vaccine strategies to fight a measles epidemic in West African countries, and he enlisted STATEWARE to make the data more comprehensible via user-friendly software.</p><p class='text'>The presentation is 25 percent of the students’ grade for their 397-level CSE course, which is worth 1.5 credits.</p><p class='text'>“My perspectives on the enterprise of software development, the dynamics of leadership and the way skilled workers function in a team are all radically different, and I've found it to be an incredible growing experience as a young professional in this industry,” said STATEWARE co-founder, computer science major Josh Crafts of Nazareth, Pennsylvania.</p><p class='text'>The class will conclude with a presentation on the technical aspects of the project's development and an unveiling of the first release. Sponsors from IBM, Lutron and Microsoft will be in attendance to see the results.</p><p class='text'>The STATEWARE students spent the semester creating user-friendly data visualization software for Ferrari’s epidemiology statistics. According to their professor, Steven Shaffer, a certified software quality engineer and assistant professor of computer science and engineering, the class offers a very unique opportunity to undergraduate students: building software from the ground up.</p><p class='text'>“It’s really good insight on their part,” said Shaffer about Craft and STATEWARE’S other co-founder, Dylan Fetch, an undergraduate in computer science. “Most of the time real world software engineers work on a program that already exists. In most classes, students start from scratch. The concept of STATEWARE is that the project will live on from semester to semester, and the students will have to pick up where the previous generation left off. The students in this class are very self-motivated and interested in building their own educational experience.”</p><p class='text'>Shaffer meets with the Fetch and Craft weekly to go over their project status. The two seek his insight if the class is stuck or facing a big challenge. The rest of the class writes a weekly report and turns it in to Shaffer so he can see their progress. He says not only does this class give students a chance to build software, it teaches them about advocating for themselves, a valuable skill in the workforce.</p><p class='text'>“If someone feels they have a notion of how to do something, they need to make sure they’re heard, and their idea needs to be discussed together before the group can move forward,” explained Shaffer.</p><p class='text'>Paul Jang, a junior computer science major from Broomall, Pennsylvania, who said he was intimidated by the project at the start of the class, said he’s excited to take the next level course, CSE 497, next semester, where the students will continue to enhance the program.</p><p class='text'>“Learning how to work in a group as well as the process of creating a usable and functional implementation definitely will prove beneficial to my professional career after school,” said Jang. “I'm excited to take a more senior role and to see other people go through the same learning experience that I did.”</p><p class='text'>After months of hard work, the students are eager to show off their accomplishments on April 30.</p><p class='text'>“It is important to have this event because this semester is our proof of concept. We want this program to grow to support any student who wants this experience,” said Fetch. “With more students, not only will we produce more quality software engineers, but we will advance the research efforts of the University with the software produced. We want to show our fellow students, faculty and our sponsors what we have created and what we have learned over the course of the semester.”"
	},
	{
		"type" : "post",
		"title" : "Visualizing Data for Smarter Measles Vaccination",
		"author" : "Joshua Crafts",
		"date" : "29 March 2015",
		"first" : "<a class='large-link' href='http://asmarterplanet.com/studentsfor/blog/2015/03/visualizing-data-smarter-measles-vaccination.html'>Original article here</a></p><p class='text'>Computation brings us unprecedented power to solve tough problems. But when those problems are worlds away, and don’t have an obvious computational solution, we need to leverage that power in a less direct way. Luckily, any problem of reasonable scale has a wealth of data associated with it, and there’s nothing computers are better at than using data in incredible ways.",
		"body" : "The Measles virus is one of the largest and most pervasive healthcare problems worldwide, and it’s one Dr. Matt Ferrari spends a good deal of his time with. Each year, Dr. Ferrari composes a large data set for statistics associated with the Measles virus worldwide, and presents it to the World Health Organization to inform vaccination policy. However, this data takes the form of large and difficult to interpret spreadsheets, and any visualization of this data has to be done piecemeal.</p><p class='text'>That’s why in the inaugural semester of Stateware, a student-led software development group at Penn State, we’re building a web platform for Dr. Ferrari that will allow users to visualize this data transparently, on demand. The platform, called Dav3i (Disease and Virus Vaccination Visualization Interface, pronounced like Davey), is aimed at improving the efficacy of worldwide Measles vaccination policy, and using the power of computation to benefit world health. When the first release of the program is complete, the WHO will have an unprecedented power to visualize, analyze, and understand the state of the Measles virus from a global perspective."
	},
	{
		"type" : "post",
		"title" : "Engineering Students Develop Their Own Curriculum",
		"author" : "Mark Atwater",
		"date" : "28 March 2015",
		"image" : {
			"src" : "res/03282015.jpg",
			"alt" : "Stateware pairs students with researchers, creates beneficial partnership. Image: Penn State",
			"height" : 419,
			"width" : 730
		},
		"first" : "<a class='large-link' href='http://www.engineering.com/Education/EducationArticles/ArticleID/9857/Engineering-Students-Develop-Their-Own-Curriculum.aspx'>Original article here</a></p><p class='text'>Engineering is about meeting real-life challenges, and engineering education can benefit from the same approach. Students in Penn State’s Computer Science and Engineering program decided to take their education into their own hands, and now they’re getting course credit for it.",
		"body" : "Engineering is an applied discipline. Students need a solid foundation before they can be fully effective, but what they often want and need is a challenge where the answer is not in the back of the STATEWARE pairs students with researchers, creates beneficial partnershipbook. Seeking this sort of hands-on engineering, two juniors, Dylan Fetch and Joshua Crafts, have developed a course where they are working for a client, not for a professor.</p><p class='text'>According to a Penn State news article, the course involves developing computer software for a current application. The students first select a client based on the proposed project for which the software is needed. Yes, you read that right. It is a competitive process to get these students working on software for your project.</p><p class='text'>In the pilot semester, the eleven enrolled students are working with, Matt Ferrari, an assistant professor of biology at Penn State. The project involves mapping annual measles epidemics in order to develop new immunization protocols.</p><p class='text'>The current data set is contained within spreadsheets with tabulated data from each country and for each year. This layout allows for tracking trends, but it is not easy to quickly compare various countries or years. As Fetch describes, \"Instead we're going to have all of the information in a database and world map so that if you click on a country, you can bring up graphs of all of the data you want.\"</p><p class='text'>The computer science class started as a student club. STATEWARE, which stands for Students Taking Advantage of Their Education While Accelerating Research Efforts, was seen as being on shaky ground as a club. This is because as students get swamped with classes, club activities drop down the priority list. Most classes do not have the time to take on large projects, so it was hoped that by combining course credit and group project development more students would participate. And ultimately benefit.</p><p class='text'>The students’ idea was supported by faculty members Steven Shaffer and Stephen Fast. They provided valuable connections with researchers and industry and helped guide the process. Additional support comes from corporate sponsors IBM, Lutron Electronics and Microsoft, as well as from Penn State's student chapter of the Association of Computing Machinery (ACM).</p><p class='text'>Projects in the 1.5 credit course are expected to extend into the next semester, and students are encouraged to enroll multiple times. The final version will be used by the World Health Organization to apprise vaccine policy. The course shows that motivated students with supportive faculty can develop innovative approaches to learning that produce lasting effects."
	},
	{
		"type" : "post",
		"title" : "Stateware Shout Out on Official PSU Twitter!",
		"author" : "@penn_state",
		"date" : "28 March 2015",
		"image" : {
			"src" : "res/03252015.png",
			"alt" : "Nittany Lion. Image: Penn State",
			"height" : 800,
			"width" : 533
		},
		"first" : "<a class='large-link' href='https://twitter.com/penn_state/status/580098846983921664'</a></p><p class='text'>STATEWARE, the brainchild of two <a href='https://twitter.com/@PSUEngineering'>@PSUEngineering</a> juniors, links students with researchers. <a href='http://bit.ly/1LO9rNo'>http://bit.ly/1LO9rNo</a>",
		"body" : ""
	},
	{
		"type" : "post",
		"title" : "Stateware pairs students with researchers, creates beneficial partnership",
		"author" : "Cate Hansberry",
		"date" : "19 March 2015",
		"image" : {
			"src" : "res/03282015.jpg",
			"alt" : "Members of Stateware, including founders Dylan Fetch (far left) and Joshua Crafts (far right), take their education into their own hands by teaming up with researchers to produce original software. . Image: Provided by Stateware",
			"height" : 419,
			"width" : 730
		},
		"first" : "<a class='large-link' href='http://www.engineering.com/Education/EducationArticles/ArticleID/9857/Engineering-Students-Develop-Their-Own-Curriculum.aspx'>Original article here</a></p><p class='text'>UNIVERSITY PARK, Pa. -- In its pilot semester, one computer science course challenges self-motivated students to develop software for a real-world application.",
		"body" : "STATEWARE, which stands for “Students Taking Advantage of Their Education While Accelerating Research Efforts,” is the brainchild of two juniors in computer science and engineering, Dylan Fetch and Joshua Crafts.</p><p class='text'>The class gives students an opportunity to pair up with researchers in the area and collaborate on large-scale projects.</p><p class='text'>Fetch, of McKeesport, Pennsylvania, and Crafts, of Nazareth, Pennsylvania, got the idea for STATEWARE when they realized a lot of researchers are looking for software.</p><p class='text'>“It’s hard to do big projects in class,” Crafts said. “This gives us hands-on experience in a way not found in the classroom.”</p><p class='text'>After hearing pitches from four different researchers, Fetch and Crafts chose to work with Matt Ferrari for their pilot program.</p><p class='text'>Ferrari is an assistant professor of biology at Penn State “investigating local and regional dynamics of annual measles epidemics in West African countries in order to recommend vaccination strategies to minimize mortality and morbidity due to measles,” according to his website.</p><p class='text'>STATEWARE plans to help Ferrari systematize his research on the deadly disease.</p><p class='text'>Eleven students are enrolled in the class this semester, including Fetch and Crafts. Each founder is leading a team to develop a data visualization platform for trends associated with the measles virus around the world.</p><p class='text'>“It just seemed like the perfect project for us,” Crafts said. “It's exactly what we were looking for.”</p><p class='text'>Fetch said the partnership will do a lot for Ferrari as well.</p><p class='text'>Before the project, Ferrari compiled his data on spreadsheets. For each spreadsheet, 193 rows each represent a country of the world. Corresponding columns represent every year from 1980 to present.</p><p class='text'>“Right now if the World Health Organization wants to compare two countries, they have to go in and pick out the data set they want and plot it,” Fetch said. “Instead we’re going to have all of the information in a database and world map so that if you click on a country, you can bring up graphs of all of the data you want.”</p><p class='text'>Crafts said this method is much more transparent and accessible than having the raw data alone. </p><p class='text'>The final program, which will have its first release at the end of the semester, will be used by the World Health Organization to inform global vaccine deployment policy.</p></br><h5 class='inline-heading'>From club to classroom</h5><p class='text'>STATEWARE started out as a club, but Fetch and Crafts recognized that the program would ultimately be unsuccessful as an extracurricular.</p><p class='text'>“People have tried this before,” Fetch said. “The main issue is that once classes start stacking up, people start giving less attention to clubs.”</p><p class='text'>Incorporating class credit gives students an incentive to work hard on the projects without feeling too overwhelmed.</p><p class='text'>Member Andrew Lopreiato said most computer science classes couldn’t teach what it is like to have a set of requirements, a development timeline and a team to work with. A typical class focuses only on the theory of algorithms and how to make a program work – STATEWARE helps fill those gaps in knowledge.</p><p class='text'>“This isn't an assignment that you hand in and get a grade, and you're done,” he said. “This class is building a project that people will be using, and that is my favorite part of it.”</p><p class='text'>STATEWARE member William Bittner said the program is a great platform for learning how to work as a team.</p><p class='text'>“I have improved my ability to work in a team atmosphere as a direct result of this class,” he said. “It's simply icing on top of the cake that at the end of this learning experience we will have developed software that not only matters, but helps make the world a safer place.”</p><p class='text'>Help from corporate sponsors IBM, Lutron Electronics Co. and Microsoft also allows STATEWARE to bring in guest speakers to “engage with the real world.”</p><p class='text'>“We’re trying to have the support from them so we can afford to do some things we wouldn’t be able to do on our own,” Crafts said. “Sponsors send representatives so students can get their perspectives on software development.”</p><p class='text'>Penn State’s student chapter of the Association of Computing Machinery (ACM) also supports STATEWARE.</p><p class='text'>“ACM absorbed us as a club so that we didn't have to start out with nothing, and we are still supported by them,” Fetch said.</p><p class='text'>The STATEWARE team credits Penn State professors Steven Shaffer and Stephen Fast with encouraging their idea. Their support helped turn the budding notion into an established university course worth 1.5 credits.</p><p class='text'>Fast introduced them to some researchers who had needs for software, introduced them to people in local entrepreneurial community who do software for a living and offered suggestions from his own experience in developing software and running a company.</p><p class='text'>“The thing that has really made this successful so far is that people have really believed in the idea,” Crafts said. “People have been willing to do things to make this happen.”</p><p class='text'>Shaffer said he was happy to help students who were taking charge of their academic careers.</p><p class='text'>\"I think it's great to see some students being proactive in preparing for their lives as software developers,” he said. “This is why I was glad to volunteer to be the faculty point person for the group.\"</p><p class='text'>Fast, who is still involved with the program and attends its weekly meetings, said the communication between the researchers and students can allow them achieve more than either group ever imagined.</p><p class='text'>“It’s a really nice mixture between doing good for the benefit of Penn State and providing the students with some real work lessons that will be extra valuable for them in their careers,” Fast said.</p><p class='text'>With Shaffer’s and Fast’s help, STATEWARE transformed from a branch of ACM into its own course, in which students are encouraged to enroll multiple times.</p><p class='text'>“We envision students will be taking this class for more than one semester,” Crafts said.</p><p class='text'>Fetch said software designers often pick up their work on a project where someone else left off.</p><p class='text'>“One of the things we really want to emphasize with the class is that you have to document your software well,” Fetch noted. “That way when you hand it off to someone else, they can read the documentation and know how to pick up where you left off.”</p><p class='text'>Crafts said this is a valuable skill that students don’t often get in classes.</p><p class='text'>“When you turn in an assignment for class, you don’t go back to it,” he said. “You don’t have to live with your mistakes.”</p><p class='text'>Although STATEWARE students will embark on a unique project with each new semester, they will continue to revisit older projects and make improvements.</p><p class='text'>Despite its sponsors and university credit, STATEWARE is very student-driven. Fetch and Crafts have overall creative control.</p><p class='text'>\"It's great for us,” Crafts said. “We want our students to feel like they’re in control of the product that they’re making.”</p><p class='text'>Fast said he envisions a promising future for this program.</p><p class='text'>“I’m impressed because I know how much work it takes and how many lessons they’ve learned the hard way,” Fast said. “This group of students is probably giving a lot more effort than the credit hours assigned to them, and as a result they’re accomplishing a lot.”"
	}
]
